api/app/controllers/api/v1/sessions_controller.rb

  def create
    user = User.find_by(email_address: params[:email_address])
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = 'frunza.sergiu3@gmail.com' LIMIT 1